### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudflare_access_application.onp_hubble_ui will be created
+   resource "cloudflare_access_application" "onp_hubble_ui" {
+       account_id                 = (known after apply)
+       app_launcher_visible       = true
+       aud                        = (known after apply)
+       auto_redirect_to_identity  = false
+       domain                     = "hubble-ui.onp-k8s.admin.seichi.click"
+       enable_binding_cookie      = false
+       http_only_cookie_attribute = true
+       id                         = (known after apply)
+       name                       = "Cilium Hubble UI"
+       service_auth_401_redirect  = false
+       session_duration           = "24h"
+       skip_interstitial          = false
+       type                       = "self_hosted"
+       zone_id                    = "77c10fdfa7c65de4d14903ed8879ebcb"
    }

  # cloudflare_access_policy.onp_hubble_ui will be created
+   resource "cloudflare_access_policy" "onp_hubble_ui" {
+       account_id     = (known after apply)
+       application_id = (known after apply)
+       decision       = "allow"
+       id             = (known after apply)
+       name           = "Require to be in a GitHub team to access"
+       precedence     = 1
+       zone_id        = "77c10fdfa7c65de4d14903ed8879ebcb"

+       include {

+           github {
+               identity_provider_id = "f5b46e49-ede0-44f2-9c83-5b25d404f7a6"
+               name                 = "GiganticMinecraft"
+               teams                = (known after apply)
            }
        }
    }

  # github_team.onp_hubble_ui will be created
+   resource "github_team" "onp_hubble_ui" {
+       create_default_maintainer = false
+       description               = "Cilium Hubble UIに接続できるTeam"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "onp-hubble-ui"
+       node_id                   = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>